# NaN - means Not a Number

In [35]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [36]:
n = np.nan

In [37]:
type(n)

float

In [38]:
m = 1
m + n

nan

# Nan in Series

In [39]:
s1 = Series([1, 2, np.nan, 3, 4], index=['A','B','C','D','E'])

In [40]:
s1

A    1.0
B    2.0
C    NaN
D    3.0
E    4.0
dtype: float64

In [41]:
s1.isnull()

A    False
B    False
C     True
D    False
E    False
dtype: bool

In [42]:
s1.notnull()

A     True
B     True
C    False
D     True
E     True
dtype: bool

In [43]:
s1

A    1.0
B    2.0
C    NaN
D    3.0
E    4.0
dtype: float64

In [44]:
s1.dropna()

A    1.0
B    2.0
D    3.0
E    4.0
dtype: float64

# NaN in DataFrame

In [45]:
dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])

In [46]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [47]:
dframe.isnull()

       0      1      2
0  False  False  False
1   True  False  False
2  False   True  False
3   True   True   True

In [48]:
dframe.notnull()

       0      1      2
0   True   True   True
1  False   True   True
2   True  False   True
3  False  False  False

In [49]:
df1 = dframe.dropna(axis=0,how='all')

In [50]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [51]:
dframe.sum(axis=0)
# axis=0为行，=1为列

0     8.0
1     7.0
2    18.0
dtype: float64

In [52]:
dframe2 = DataFrame([[1,2,3,np.nan],[2,np.nan,5,6],[np.nan,7,np.nan,9],[1,np.nan,np.nan,np.nan]])

In [53]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [54]:
df2 = dframe2.dropna(thresh=2)
# 这行的nan大于2个就drop

In [55]:
df2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [56]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [67]:
dframe2.fillna(value=100)
# 将值为nan的更改为值为100

       0      1      2      3
0    1.0    2.0    3.0  100.0
1    2.0  100.0    5.0    6.0
2  100.0    7.0  100.0    9.0
3    1.0  100.0  100.0  100.0

In [58]:
dframe2.fillna(value={0:0,1:1,2:2,3:3})

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0

In [59]:
df1 = dframe

In [60]:
df2 = dframe2

In [61]:
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [62]:
df2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [63]:
df1.dropna()

     0    1    2
0  1.0  2.0  3.0

In [64]:
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [68]:
df1.fillna(100)

       0      1      2
0    1.0    2.0    3.0
1  100.0    5.0    6.0
2    7.0  100.0    9.0
3  100.0  100.0  100.0

In [66]:
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN